app/views/real_estates/create.html.erb

SELECT "units".* FROM "units"
---
  current_sell_unit = current_rent_unit = nil
  Unit.get_options.each do |u|

SELECT "real_estate_types".* FROM "real_estate_types"
---
  # Real estate options
  current_re_type_group = @re.real_estate_type_id.blank? ? 'land' : @re.real_estate_type.options_hash['group']

SELECT "purposes".* FROM "purposes"
---
          <select name="real_estate[purpose_id]" class="form-control input-toggle" id="purpose">
            <% Purpose.get_options.each do |p| %>

SELECT "currencies".* FROM "currencies"
---
          <select name="real_estate[currency_id]" class="form-control" id="currency_id">
            <% Currency.get_options.each do |c| %>

SELECT "street_types".* FROM "street_types"
---
            <label class="radio-inline">
              <input type="radio" name="real_estate[street_type]" value="2" <%= 'checked' if @re.street_type.blank? || @re.street_type == 1 %> /><%= t 'real_estate.attribute.public_street' %>

SELECT "directions".* FROM "directions"
---
          <select class="form-control" name="real_estate[direction_id]" id="direction_id">
            <% Direction.get_options.each do |d| %>

SELECT "constructional_levels".* FROM "constructional_levels"
---
          <select class="form-control" name="real_estate[constructional_level_id]" id="contructional_level_id">
            <% ConstructionalLevel.get_options.each do |l| %>

SELECT "legal_record_types".* FROM "legal_record_types"
---
              <select name="real_estate[legal_record_type_id]" class="form-control input-toggle" id="legal_record_type_id">
                <% LegalRecordType.get_options.each do |t| %>

SELECT "planning_status_types".* FROM "planning_status_types"
---
              <select name="real_estate[planning_status_type_id]" class="form-control input-toggle" id="planning_status_type_id">
                <% PlanningStatusType.get_options.each do |t| %>

SELECT "property_utilities".* FROM "property_utilities"
---
        <article class="form-group">
          <% PropertyUtility.get_options.each do |u| %>

SELECT "region_utilities".* FROM "region_utilities"
---
        <article class="form-group">
          <% RegionUtility.get_options.each do |u| %>

SELECT "advantages".* FROM "advantages"
---
        <article class="form-group">
          <% Advantage.get_options.each do |a| %>

SELECT "disadvantages".* FROM "disadvantages"
---
        <article class="form-group">
          <% Disadvantage.get_options.each do |d| %>