app/views/real_estates/view.html.erb

					</article>
					<% if (@re.fields.include?(:property_utility) && @re.property_utilities.present?) || (@re.fields.include?(:region_utility) && @re.region_utilities.present?)  %>
---
SELECT "property_utilities".* FROM "property_utilities" INNER JOIN "property_utilities_real_estates" ON "property_utilities"."id" = "property_utilities_real_estates"."property_utility_id" WHERE "property_utilities_real_estates"."real_estate_id" = $1  [["real_estate_id", 3]]
SELECT "region_utilities".* FROM "region_utilities" INNER JOIN "real_estates_region_utilities" ON "region_utilities"."id" = "real_estates_region_utilities"."region_utility_id" WHERE "real_estates_region_utilities"."real_estate_id" = $1  [["real_estate_id", 2]]