app/controllers/advantages_controller.rb

  def index
    @advantages = Advantage.all
---
SELECT "advantages".* FROM "advantages"