app/controllers/constructional_levels_controller.rb

SELECT "constructional_levels".* FROM "constructional_levels"
---
  def index
    @constructional_levels = ConstructionalLevel.all