app/controllers/directions_controller.rb

SELECT "directions".* FROM "directions"
---
  def index
    @directions = Direction.all