app/controllers/disadvantages_controller.rb

SELECT "disadvantages".* FROM "disadvantages"
---
  def index
    @disadvantages = Disadvantage.all