app/controllers/legal_record_types_controller.rb

SELECT "legal_record_types".* FROM "legal_record_types"
---
  def index
    @legal_record_types = LegalRecordType.all