app/controllers/planning_status_types_controller.rb

SELECT "planning_status_types".* FROM "planning_status_types"
---
  def index
    @planning_status_types = PlanningStatusType.all