app/controllers/property_utilities_controller.rb

SELECT "property_utilities".* FROM "property_utilities"
---
  def index
    @property_utilities = PropertyUtility.all

INSERT INTO "property_utilities" ("name", "code", "options", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Tầng hầm"], ["code", ""], ["options", ""], ["created_at", "2015-03-27 06:47:21.065968"], ["updated_at", "2015-03-27 06:47:21.065968"]]
---
  def create
    @property_utility = PropertyUtility.new(property_utility_params)

    respond_to do |format|
      if @property_utility.save

SELECT  "property_utilities".* FROM "property_utilities" WHERE "property_utilities"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_property_utility
      @property_utility = PropertyUtility.find(params[:id])