app/controllers/purposes_controller.rb

  def index
    @purposes = Purpose.all
---
SELECT "purposes".* FROM "purposes"