app/controllers/real_estate_utilities_controller.rb

  def index
    @real_estate_utilities = RealEstateUtility.all
---
SELECT "real_estate_utilities".* FROM "real_estate_utilities"