app/controllers/real_estate_types_controller.rb

SELECT "real_estate_types".* FROM "real_estate_types"
---
  def index
    @real_estate_types = RealEstateType.all