app/controllers/real_estates_controller.rb

SELECT  "real_estates".* FROM "real_estates" WHERE "real_estates"."id" = $1 LIMIT 1  [["id", 2]]
---
        def view
            # Get id from full_slug
            id = params[:full_slug][((params[:full_slug].rindex('-') || -1) + 1)...params[:full_slug].length]

            @re = RealEstate.find id

INSERT INTO "advantages_real_estates" ("advantage_id", "real_estate_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["advantage_id", 1], ["real_estate_id", 3], ["created_at", "2015-03-27 07:23:58.132628"], ["updated_at", "2015-03-27 07:23:58.132628"]]
INSERT INTO "disadvantages_real_estates" ("disadvantage_id", "real_estate_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["disadvantage_id", 2], ["real_estate_id", 3], ["created_at", "2015-03-27 07:23:58.169234"], ["updated_at", "2015-03-27 07:23:58.169234"]]
INSERT INTO "real_estates" ("title", "description", "purpose_id", "price", "currency_id", "unit_id", "province_id", "district_id", "ward_id", "street_id", "address_number", "street_type_id", "is_alley", "real_estate_type_id", "direction_id", "width_x", "width_y", "shape", "legal_record_type_id", "planning_status_type_id", "custom_advantages", "custom_disadvantages", "alley_width", "campus_area", "using_area", "constructional_area", "restroom_number", "bedroom_number", "build_year", "constructional_level_id", "constructional_quality", "floor_number", "shape_width", "custom_legal_record_type", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27, $28, $29, $30, $31, $32, $33, $34, $35, $36, $37) RETURNING "id"
SELECT  "real_estates".* FROM "real_estates" WHERE "real_estates"."id" = $1 LIMIT 1  [["id", nil]]
---
        def save

            if signed?
                params[:real_estate][:user_id] = current_user.id
                params[:real_estate][:user_type] = 'user'
            else
                contact_user = _save_contact_user_info params[:contact_info]
                params[:real_estate][:user_id] = contact_user.id
                params[:real_estate][:user_type] = 'contact_user'
            end

            re = nil
            result = nil
            ActiveRecord::Base.transaction do
                re = params[:id].present? ? RealEstate.find(params[:id]) : RealEstate.create