app/controllers/region_utilities_controller.rb

SELECT "region_utilities".* FROM "region_utilities"
---
  def index
    @region_utilities = RegionUtility.all