app/controllers/street_types_controller.rb

  def index
    @street_types = StreetType.all
---
SELECT "street_types".* FROM "street_types"

  def update
    respond_to do |format|
      if @street_type.update(street_type_params)
---
UPDATE "street_types" SET "name" = $1, "options" = $2, "updated_at" = $3 WHERE "street_types"."id" = $4  [["name", "Đường chính"], ["options", ""], ["updated_at", "2015-03-27 08:20:57.257276"], ["id", 1]]

    def set_street_type
      @street_type = StreetType.find(params[:id])
---
SELECT  "street_types".* FROM "street_types" WHERE "street_types"."id" = $1 LIMIT 1  [["id", 1]]